In [1]:
import pandas as pd
import numpy as np

In [18]:
data = pd.Series(np.random.randn(9),index=[['a','a','a','b','b','b','c','c','c',
                                          ],[1,2,3,1,2,3,1,2,3]])

In [6]:
data

a  1   -0.675723
   1   -0.219096
   1    0.736484
b  2   -1.236951
   2   -1.434164
   2   -0.426070
c  3   -0.201253
   3    0.102235
   3   -2.018073
dtype: float64

In [7]:
data.index

MultiIndex(levels=[['a', 'b', 'c'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 2], [0, 0, 0, 1, 1, 1, 2, 2, 2]])

In [12]:
data[:,1]

a   -0.675723
a   -0.219096
a    0.736484
dtype: float64

In [16]:
data.loc['a':'b',2]

b  2   -1.236951
   2   -1.434164
   2   -0.426070
dtype: float64

In [19]:
data.unstack()

          1         2         3
a -0.391983 -0.421293  0.122048
b  0.811631  1.531006 -0.058509
c -0.462916 -0.510141 -0.446451

In [23]:
frame = pd.DataFrame(np.arange(12).reshape((4,3)),index=[['a','a','b','b'],
                                                         [1,2,1,2]],
                                                  columns=[['BOOT','BOOT','ADA'],['FREE','COST','FREE']])

In [25]:
frame

    BOOT       ADA
    FREE COST FREE
a 1    0    1    2
  2    3    4    5
b 1    6    7    8
  2    9   10   11

In [26]:
frame.index.names = ['key1','key2']

In [27]:
frame.columns.names = ['name','type']

In [28]:
frame

name      BOOT       ADA
type      FREE COST FREE
key1 key2
a    1       0    1    2
     2       3    4    5
b    1       6    7    8
     2       9   10   11

In [38]:
frame.iloc[:3,:3]

name      BOOT       ADA
type      FREE COST FREE
key1 key2
a    1       0    1    2
     2       3    4    5
b    1       6    7    8

In [39]:
frame.swaplevel('key1','key2')

name      BOOT       ADA
type      FREE COST FREE
key2 key1
1    a       0    1    2
2    a       3    4    5
1    b       6    7    8
2    b       9   10   11

In [45]:
frame

name      BOOT       ADA
type      FREE COST FREE
key1 key2
a    1       0    1    2
     2       3    4    5
b    1       6    7    8
     2       9   10   11

In [43]:
frame.sort_index(level=1)

name      BOOT       ADA
type      FREE COST FREE
key1 key2
a    1       0    1    2
b    1       6    7    8
a    2       3    4    5
b    2       9   10   11

In [44]:
frame.swaplevel(0,1).sort_index(level=0)

name      BOOT       ADA
type      FREE COST FREE
key2 key1
1    a       0    1    2
     b       6    7    8
2    a       3    4    5
     b       9   10   11

In [46]:
frame.sum(level='key2')

name BOOT       ADA
type FREE COST FREE
key2
1       6    8   10
2      12   14   16

In [48]:
frame.sum(level=0)

name BOOT       ADA
type FREE COST FREE
key1
a       3    5    7
b      15   17   19

In [50]:
frame.sum(level='name',axis=1)

name       ADA  BOOT
key1 key2
a    1       2     1
     2       5     7
b    1       8    13
     2      11    19

In [51]:
frame=pd.DataFrame({'a':range(7),'b':range(7,0,-1),
                    'c':['one','one','one','two','two','two','two'],'d':[
                        0,1,2,0,1,2,3
                    ]})

In [52]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [53]:
frame2 = frame.set_index(['c','d'])

In [54]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [55]:
frame.set_index(['c','d'],drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [56]:
df1 = pd.DataFrame({'key':['b','b','a','c','a','a','b'],'data1':range(7)})

In [57]:
df2 = pd.DataFrame({'key':['a','b','d'],'data2':range(3)})

In [58]:
df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   a
6      6   b

In [59]:
df2

   data2 key
0      0   a
1      1   b
2      2   d

In [61]:
pd.merge(df1,df2)

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [62]:
left1 = pd.DataFrame({'key':['a','b','a','a','b','c'],'value':range(6)})

In [64]:
right1 = pd.DataFrame({'group_val':[3.5,7]},index = ['a','b'])

In [65]:
lef1

NameError: name 'lef1' is not defined

In [66]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [67]:
right1

   group_val
a        3.5
b        7.0

In [68]:
pd.merge(left1,right1,left_on='key',right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [69]:
pd.merge(left1,right1,left_on='key',right_index=True,how='outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [70]:
arr = np.arange(12).reshape((3,4))

In [71]:
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [72]:
np.concatenate([arr,arr],axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [73]:
s1 = pd.Series([0,1],index = ['a','b'])

In [74]:
s2 = pd.Series([2,3,4],index = ['c','d','e'])
s3 = pd.Series([5,6],index = ['f','g'])

In [75]:
pd.concat([s1,s2,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [76]:
a = pd.Series([np.nan,2.5,np.nan,3.5,4.5,np.nan],index = ['f','e','d','c','b','a'])

In [77]:
b = pd.Series(np.arange(len(a)),dtype = np.float64,index = ['f','e','d','c','b','a'])

In [78]:
b[:-2].combine_first(a[2:])

a    NaN
b    4.5
c    3.0
d    2.0
e    1.0
f    0.0
dtype: float64